/*
 *
 * Librería para las señales a emitir por el mando
 *
 */

#include "signals.h"


// Señal capturada del archivo .csv
// Valores en microsegundos
// Alterna MARK (1), SPACE (0), MARK (1), SPACE (0)...

// Señal mando genérico, botón 0
const uint16_t ir_signal_mando0[] = { 9100, 4450, 600, 550, 600, 600, 600, 550, 600,
                               550, 600, 550, 600, 550, 600, 600, 550, 600, 600,
                               1650, 550, 1700, 550, 1650, 600, 1650, 549, 1651,
                               600, 1650, 550, 1700, 550, 1650, 600, 1650, 550,
                               600, 600, 550, 600, 1650, 550, 1700, 550, 600,
                               550, 600, 550, 600, 600, 550, 600, 1650, 600,
                               1650, 550, 600, 550, 600, 600, 1650, 550, 1700,
                               550, 1650, 600, 39200 };

const IRSignal SIGNAL_MANDO_0 = {
                                 .data = ir_signal_mando0,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "MANDO_0"
};

// Señal Power
const uint16_t ir_signal_power[] = { 2040, 900, 120, 110, 110, 110, 120, 110, 110,
                               110, 120, 110, 120, 110, 110, 110, 120, 110, 120,
                               340, 110, 340, 110, 330, 120, 330, 120, 330, 110,
                               340, 110, 329, 121, 110, 110, 110, 120, 110, 120,
                               110, 120, 110, 120, 110, 120, 110, 140, 100, 140,
                               110, 140, 330, 120, 340, 110, 340, 120, 330, 120,
                               320, 120, 330, 120, 340, 110, 340, 110, 42190 };
const IRSignal SIGNAL_MANDO_POWER = {
                                 .data = ir_signal_power,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "POWER"
};

// Señal Subir Volumen
const uint16_t ir_signal_volup[] = { 9080, 4520, 570, 540, 570, 550, 560, 550, 570,
                               540, 570, 550, 570, 540, 570, 540, 570, 550, 570,
                               1650, 570, 1660, 570, 1650, 570, 1660, 570, 1660,
                               570, 1650, 570, 1660, 570, 540, 570, 1660, 570,
                               1650, 570, 550, 570, 1650, 570, 1660, 570, 550,
                               560, 550, 570, 540, 570, 550, 560, 550, 570,
                               1650, 570, 550, 570, 540, 570, 1660, 570, 1650,
                               570, 1660, 570, 42190 };
const IRSignal SIGNAL_MANDO_VOLUP = {
                                 .data = ir_signal_volup,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "VOL_UP"
};

// Señal Bajar Volumen
const uint16_t ir_signal_voldown[] = { 9080, 4500, 590, 520, 590, 530, 590, 520, 590,
                               520, 600, 520, 590, 520, 590, 520, 600, 520, 590,
                               1660, 570, 1660, 570, 1650, 570, 1659, 570, 1661,
                               560, 1660, 570, 1660, 570, 520, 590, 520, 590,
                               1660, 570, 520, 590, 1660, 570, 1660, 570, 540,
                               570, 540, 570, 550, 570, 1650, 570, 550, 570,
                               1660, 560, 550, 570, 540, 570, 1660, 570, 1660,
                               559, 1661, 570, 42170 };
const IRSignal SIGNAL_MANDO_VOLDOWN = {
                                 .data = ir_signal_voldown,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "VOL_DOWN"
};


// Señal Mute
const uint16_t ir_signal_mute[] = {  9090, 4510, 570, 520, 600, 520, 590, 520, 590,
                               530, 590, 520, 590, 520, 600, 520, 590, 520, 590,
                               1660, 570, 1660, 570, 1660, 560, 1659, 570, 1661,
                               570, 1650, 570, 1660, 570, 520, 590, 530, 590,
                               1660, 560, 1660, 570, 520, 600, 1650, 570, 530,
                               590, 520, 590, 520, 590, 1660, 570, 520, 590,
                               530, 590, 1660, 570, 520, 590, 1660, 570, 1650,
                               570, 1660, 570, 42160 };
const IRSignal SIGNAL_MANDO_MUTE = {
                                 .data = ir_signal_mute,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "MUTE"
};

// Señal La 1
const uint16_t ir_signal_la1[] = { 9080, 4500, 590, 520, 600, 520, 590, 520, 590,
                               520, 600, 500, 610, 520, 600, 510, 600, 520, 590,
                               1660, 570, 1660, 570, 1650, 570, 1659, 570, 1661,
                               570, 1650, 570, 1660, 570, 520, 590, 1660, 570,
                               520, 590, 520, 600, 510, 600, 500, 610, 520, 600,
                               520, 590, 520, 600, 510, 600, 1660, 570, 1650,
                               570, 1660, 570, 1660, 570, 1650, 570, 1660, 570,
                               1650, 570, 42160 };
const IRSignal SIGNAL_MANDO_LA1 = {
                                 .data = ir_signal_la1,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "LA_1"
};

// Señal La 2
const uint16_t ir_signal_la2[] = { 9080, 4500, 590, 520, 600, 520, 590, 520, 590,
                               520, 600, 520, 590, 520, 590, 520, 600, 520, 590,
                               1660, 570, 1650, 570, 1660, 570, 1659, 570, 1651,
                               570, 1660, 570, 1660, 560, 520, 600, 520, 590,
                               1660, 570, 520, 590, 520, 600, 520, 590, 520,
                               590, 520, 600, 520, 590, 1660, 570, 520, 590,
                               1660, 570, 1650, 570, 1660, 570, 1650, 570, 1660,
                               569, 1661, 570, 42160 };
const IRSignal SIGNAL_MANDO_LA2 = {
                                 .data = ir_signal_la2,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "LA_2"
};

// Señal Antena 3
const uint16_t ir_signal_antena3[] = { 9090, 4490, 590, 520, 600, 520, 590, 510, 600,
                               520, 600, 520, 590, 520, 600, 510, 600, 520, 590,
                               1660, 570, 1660, 570, 1650, 570, 1659, 570, 1661,
                               570, 1650, 570, 1660, 570, 520, 590, 1660, 570,
                               1660, 570, 520, 590, 520, 600, 510, 600, 520,
                               590, 520, 600, 510, 600, 520, 590, 520, 600,
                               1650, 570, 1660, 570, 1660, 570, 1650, 570, 1660,
                               570, 1650, 570, 42170 };
const IRSignal SIGNAL_MANDO_ANTENA3 = {
                                 .data = ir_signal_antena3,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "ANTENA_3"
};

// Señal la 4
const uint16_t ir_signal_la4[] = { 9080, 4500, 590, 540, 570, 450, 670, 520, 590,
                               520, 590, 550, 570, 540, 570, 520, 600, 540, 570,
                               1660, 560, 1660, 570, 1660, 570, 1659, 561, 1660,
                               570, 1660, 570, 1660, 560, 550, 570, 520, 590,
                               550, 560, 1660, 570, 550, 570, 520, 590, 520,
                               590, 550, 570, 540, 570, 1660, 570, 1660, 560,
                               530, 590, 1650, 570, 1660, 570, 1660, 570, 1650,
                               569, 1661, 570, 42170 };
const IRSignal SIGNAL_MANDO_LA4 = {
                                 .data = ir_signal_la4,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "LA_4"
};

// Señal Telecinco
const uint16_t ir_signal_telecinco[] = { 9090, 4490, 590, 520, 600, 520, 590, 520, 600,
                               510, 600, 520, 590, 520, 600, 520, 590, 520, 590,
                               1660, 570, 1660, 570, 1650, 570, 1659, 570, 1661,
                               570, 1650, 570, 1660, 570, 520, 590, 1660, 570,
                               520, 590, 1660, 570, 520, 590, 520, 600, 520,
                               590, 520, 590, 520, 600, 520, 590, 1660, 570,
                               520, 590, 1660, 570, 1650, 570, 1660, 570, 1650,
                               580, 1650, 570, 42160 };
const IRSignal SIGNAL_MANDO_TELECINCO = {
                                 .data = ir_signal_telecinco,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "TELECINCO"
};

// Señal La Sexta
const uint16_t ir_signal_lasexta[] = { 9080, 4500, 590, 540, 570, 550, 570, 540, 570,
                               540, 570, 550, 570, 540, 570, 550, 570, 540, 570,
                               1660, 570, 1650, 570, 1660, 570, 1659, 561, 1660,
                               570, 1660, 570, 1650, 570, 550, 570, 540, 570,
                               1660, 570, 1650, 570, 550, 570, 540, 570, 540,
                               570, 550, 570, 540, 570, 1660, 570, 540, 570,
                               550, 570, 1650, 570, 1660, 570, 1660, 570, 1650,
                               569, 1661, 570, 42160 };
const IRSignal SIGNAL_MANDO_LASEXTA = {
                                 .data = ir_signal_lasexta,
                                 .length = 68,
                                 .carrier_khz = 38, // NEC usa 38 kHz, ajustar PWM
                                 .name  = "LA_SEXTA"
};

//Tabla opcional de señales (A FUTURO BORRAR SI NO SE USA)
//const IRSignal * const ALL_SIGNALS[] = {
//    &SIGNAL_MANDO_0
//};
//const size_t NUM_SIGNALS = sizeof(ALL_SIGNALS) / sizeof(ALL_SIGNALS[0]);


